package lesson_10;

import lesson_10.media.myAudioDisk;

public class main {
    public static void main(String[] args) {
        // * Вы работаете над программой-каталогом домашней медиа-библиотеки фильмов и музыкальных альбомов на DVD дисках (образах).
        //        * 1. Разобрать классы для хранения информации о:
        //        - музыкальных альбомах (название альбома, исполнитель, год издания, количество треков)
        //        - фильмах (название, год выхода, студия издатель, режиссер, продолжительность в минутах)
        //        * 2. Создать массив дисков с неоднородным составом (фильмы и музыкальные диски),
        //        заполнить его несколькими элементами, вывести все элементы на экран.
        //        * 3. Найти в массиве самый старый диск и вывести информацию о нем на экран.

        myAudioDisk audioDisk1 = new myAudioDisk();
        myAudioDisk audioDisk2 = new myAudioDisk();
        myAudioDisk audioDisk3 = new myAudioDisk();


    }
}
