package lesson_17.homework;

public class Task04 {
    public static void main(String[] args) {
        // Задача 4
        // Создать коллекцию Map<String, String> (реализация HashMap), занести туда 10 пар строк:
        // арбуз - ягода,
        // банан - трава,
        // вишня - ягода,
        // груша - фрукт,
        // дыня - овощ,
        // ежевика - куст,
        // жень-шень - корень,
        // земляника - ягода,
        // ирис - цветок,
        // картофель - клубень.
        // Вывести содержимое коллекции на экран, каждый элемент с новой строки.
        // Пример вывода (тут показана только одна строка):
        // картофель - клубень


    }
}
