package lesson_17.homework;

public class Task03 {
    public static void main(String[] args) {
        // Задача 3
        // Задача: Программа определяет, какая семья (фамилию) живёт в доме с указанным номером.
        // Новая задача: Программа должна работать не с номерами домов, а с городами:
        // Пример ввода:
        //   Москва -  Ивановы
        //   Киев - Петровы
        //   Лондон - Абрамовичи
        //
        // Пример ввода: Лондон
        // Пример вывода: Абрамовичи
        //
        // public static void main(String[] args) throws IOException {
        //        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        //        Map<String, String> map = new HashMap<>();
        //        while (true) {
        //            String city = reader.readLine();
        //            if (city.isEmpty()) {
        //                break;
        //            }
        //            String family = reader.readLine();
        //
        //            map.put(city, family);
        //        }
        //
        //        String city = reader.readLine();
        //
        //        if (map.containsKey(city)) {
        //            String familyName = map.get(city);
        //            System.out.println(familyName);
        //        }
        //    }


    }
}
